{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "dtype": "float32", "embeddings_constraint": null, "batch_input_shape": [null, 500], "input_dim": 110000, "input_length": 500, "trainable": true, "activity_regularizer": null, "mask_zero": false, "output_dim": 75, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.2, "seed": null, "trainable": true}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1], "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "padding": "valid", "strides": [1], "bias_regularizer": null, "filters": 100, "bias_constraint": null}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 350, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "rate": 0.2, "seed": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "units": 3, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "softmax", "trainable": true}}]}}
